/*
百钱买百鸡
公鸡一只五钱，母鸡一只三钱，小鸡一钱三只
用一百块钱卖一百只鸡，每种鸡至少一只，问三种鸡各买多少只

枚举变量：公鸡，母鸡，小鸡
枚举范围：公鸡、，母鸡、小鸡都是1~100次
判断条件：钱数=100， 总计数=100
小鸡%3=0
总计算次数：100*100*100

缩小枚举范围
公鸡数：1~18，母鸡数：1~32 小鸡数：1~98

缩小枚举变量
*/
#include<stdio.h>
int main()
{
    for (int i =1 ; i <=18; i++)
    {
        for (int j = 1; j <=32; j++)
        {
            if (5*i+3*j+(100-i-j)/3==100&(100-i-j)%3==0)
            {
                printf("公鸡数：%d ", i);
                printf("母鸡数：%d ", j);
                printf("小鸡数：%d\n", 100-i-j);
            }

        }
    }
}